[
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/hotel-resort_CPFJYMYEQH.jpg",
    "estate_title": "Luxury Beachfront Resort",
    "id": "RES001",
    "segment_name": "Resort",
    "description": "Located on the picturesque shores of Maui, Hawaii, our Luxury Beachfront Resort stands as a testament to opulence and tranquility. From the moment you arrive, you're enveloped in an atmosphere of serenity and luxury, where every detail has been meticulously crafted to ensure an unforgettable stay. As you step into our resort, you're greeted by the sight of swaying palm trees, pristine white sands, and the azure waters of the Pacific Ocean stretching endlessly before you. The architecture seamlessly blends with the natural beauty of its surroundings, offering a harmonious retreat from the hustle and bustle of everyday life. Our accommodations redefine luxury living, with spacious rooms and suites adorned with elegant furnishings and modern amenities. Whether you choose a deluxe room with ocean views or a lavish beachfront suite, each space is designed to provide the utmost comfort and relaxation. Sink into plush bedding, unwind in your private balcony, or pamper yourself in the marble-clad bathroom complete with a rain shower and luxurious bath amenities. Beyond the comforts of your room, our resort offers an array of world-class amenities to indulge your every whim. Take a refreshing dip in our infinity pool overlooking the ocean, where you can soak up the sun on plush loungers or sip cocktails at the poolside bar. For those seeking ultimate relaxation, our onsite spa offers a range of rejuvenating treatments and massages inspired by Hawaiian traditions. Adventure awaits around every corner, with a host of activities to suit every interest. From snorkeling and paddleboarding in the crystal-clear waters to guided hikes through lush rainforests, there's no shortage of ways to immerse yourself in the natural beauty of Maui. Whether you're seeking a romantic getaway, a family vacation, or simply a moment of tranquility amidst breathtaking scenery, our Luxury Beachfront Resort offers an unforgettable escape to paradise.",
    "price": "$500 per night",
    "status": "Rent",
    "area": "10,000 sq ft",
    "location": "Maui, Hawaii",
    "facilities": ["infinity pool", "private beach access", "spa", "tennis courts"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/mountain-house_IK1HVYUZA5.jpg",
    "estate_title": "Cozy Mountain Lodge",
    "id": "LOD002",
    "segment_name": "Lodge",
    "description": "Escape to the serenity of the mountains in our cozy lodge retreat, perfect for nature lovers and outdoor enthusiasts. Tucked away amidst the breathtaking landscape of Aspen, Colorado, our Cozy Mountain Lodge offers a peaceful sanctuary where you can reconnect with nature and unwind in comfort. From the moment you arrive, you're greeted by the crisp mountain air, towering pine trees, and the promise of adventure that awaits. Step into our inviting lodge and feel the warmth of the fireplace crackling in the cozy lounge area, where you can curl up with a good book or gather with loved ones for a game night. Our accommodations exude rustic charm while offering modern comforts, with spacious rooms and suites featuring plush bedding, rustic furnishings, and panoramic views of the surrounding mountains. Each room is thoughtfully appointed with amenities designed to enhance your stay, including a private bathroom, complimentary Wi-Fi, and a flat-screen TV for your entertainment. Outside your door, a world of outdoor exploration awaits. Lace up your hiking boots and set out to discover the scenic trails that wind through the nearby mountains, where you can marvel at cascading waterfalls, abundant wildlife, and panoramic vistas that stretch as far as the eye can see. In the winter months, Aspen transforms into a winter wonderland, with world-class skiing, snowboarding, and snowshoeing just minutes away from our lodge. After a day of adventure, return to the lodge and unwind in the outdoor hot tub, where you can soothe tired muscles while gazing up at the starry night sky. For those seeking relaxation, our onsite sauna offers the perfect retreat, allowing you to detoxify and rejuvenate body and mind amidst the tranquil mountain setting. Whether you're seeking outdoor adventure or simply a peaceful retreat amidst nature, our Cozy Mountain Lodge offers the perfect escape for your next mountain getaway.",
    "price": "$300 per night",
    "status": "Rent",
    "area": "3,000 sq ft",
    "location": "Aspen, Colorado",
    "facilities": ["fireplace", "hiking trails access", "sauna", "game room"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/motel-trees_LDD3TARXVE.jpg",
    "estate_title": "Seaside Motel",
    "id": "MOT003",
    "segment_name": "Motel",
    "description": "Enjoy a comfortable stay by the sea in our quaint seaside motel, conveniently located near popular attractions. Nestled along the sun-kissed shores of Santa Monica, California, our Seaside Motel offers a charming retreat where you can relax, unwind, and soak up the laid-back coastal vibe. From the moment you arrive, you're greeted by the sound of crashing waves, the salty sea breeze, and the promise of endless adventures that await just steps from your door. Step into our cozy motel and feel instantly at home in our bright and airy rooms, each thoughtfully appointed with everything you need for a comfortable stay. Sink into plush bedding, catch up on your favorite shows on the flat-screen TV, or simply enjoy the ocean views from your private balcony. Outside, our motel grounds offer plenty of space to relax and soak up the California sunshine. Take a leisurely stroll along the boardwalk, where you can browse shops, savor fresh seafood at waterfront restaurants, or simply watch the sunset over the Pacific Ocean. For those seeking adventure, the beach beckons with opportunities for surfing, paddleboarding, and beach volleyball, while nearby attractions like the Santa Monica Pier and Venice Beach offer endless entertainment options for visitors of all ages. After a day of fun in the sun, return to the motel and unwind in our outdoor seating area, where you can swap stories with fellow travelers or simply enjoy the peace and quiet of the evening. With its prime location, comfortable accommodations, and laid-back atmosphere, our Seaside Motel is the perfect choice for your next beach getaway.",
    "price": "$100 per night",
    "status": "Rent",
    "area": "1,500 sq ft",
    "location": "Santa Monica, California",
    "facilities": ["ocean view rooms", "free parking", "Wi-Fi", "24-hour front desk"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/modern-room_HNJJOEYRQG.jpg",
    "estate_title": "Modern Vacation Rental",
    "id": "VAC004",
    "segment_name": "Vacation Rental",
    "description": "Experience the comforts of home in our modern vacation Rental, perfect for families and groups. Nestled in the heart of Orlando, Florida, our Modern Vacation Rental offers a stylish and comfortable retreat for travelers seeking a home away from home. From the moment you arrive, you're greeted by sleek and contemporary design, thoughtfully appointed amenities, and all the comforts you need for a memorable stay. Step into our spacious vacation Rental and feel instantly at ease in the bright and airy living space, where floor-to-ceiling windows flood the room with natural light and offer stunning views of the surrounding area. Kick back and relax in the comfortable seating area, catch up on your favorite shows on the flat-screen TV, or whip up a delicious meal in the fully equipped kitchen, complete with modern appliances and ample counter space. With multiple bedrooms and bathrooms, our vacation Rental offers plenty of space for families and groups to spread out and enjoy privacy and comfort during their stay. Outside, a private pool beckons, offering the perfect spot to cool off on hot Florida days or simply relax and soak up the sunshine. For those seeking entertainment, a game room provides hours of fun with a pool table, foosball, and more. When it's time to explore, our vacation Rental is ideally situated just minutes from Orlando's top attractions, including theme parks, shopping centers, and world-class dining options. Whether you're planning a family vacation, a group getaway, or a romantic retreat, our Modern Vacation Rental offers the perfect base for your Orlando adventure.",
    "price": "$200 per night",
    "status": "Rent",
    "area": "2,500 sq ft",
    "location": "Orlando, Florida",
    "facilities": ["fully equipped kitchen", "private pool", "game room", "BBQ area"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/208203154.jpg?k=faed696fb29f8195ab8f0d1a92716ffae23d0d9437516ea3d586000be98db951&o=&hp=1",
    "estate_title": "Charming Guesthouse",
    "id": "GUE005",
    "segment_name": "Guesthouse",
    "description": "Stay in our charming guesthouse nestled in a tranquil garden setting, offering personalized hospitality and relaxation. Tucked away in the historic city of Savannah, Georgia, our Charming Guesthouse offers a peaceful retreat where you can unwind and immerse yourself in the timeless charm of the South. From the moment you arrive, you're greeted by the scent of magnolia blossoms, the sound of chirping birds, and the promise of southern hospitality that awaits. Step into our cozy guesthouse and feel instantly at home in our inviting and thoughtfully appointed accommodations. Each room is decorated with a blend of traditional southern charm and modern comforts, offering a serene oasis where you can relax and recharge during your stay. Curl up with a good book in the comfortable seating area, catch up on your favorite shows on the flat-screen TV, or simply enjoy the views of the lush garden outside your window. Outside, our tranquil garden beckons, offering a peaceful escape where you can stroll along winding pathways, relax in a shaded hammock, or simply enjoy a cup of sweet tea on the veranda. For those seeking adventure, our guesthouse offers bicycle Rentals, allowing you to explore the historic streets of Savannah at your own pace. When it's time to refuel, start your day with a delicious continental breakfast served in our charming dining room, where you can enjoy fresh pastries, seasonal fruit, and freshly brewed coffee. In the afternoon, join us for complimentary tea and cookies, served daily in our cozy lounge area. With its warm hospitality, tranquil setting, and convenient location near Savannah's top attractions, our Charming Guesthouse offers the perfect retreat for your next southern getaway.",
    "price": "$150 per night",
    "status": "Rent",
    "area": "1,200 sq ft",
    "location": "Savannah, Georgia",
    "facilities": ["garden view rooms", "continental breakfast", "bicycle Rentals", "outdoor seating area"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/building-balconies_H8SXFODO3W.jpg",
    "estate_title": "Urban Boutique Hotel",
    "id": "HOT006",
    "segment_name": "Hotel",
    "description": "Discover urban sophistication in our boutique hotel located in the heart of the city, offering stylish accommodations and vibrant nightlife. Situated in the bustling metropolis of New York City, our Urban Boutique Hotel offers a chic and stylish retreat for travelers seeking the perfect blend of luxury and convenience. From the moment you arrive, you're swept up in the energy and excitement of the city, with world-class dining, shopping, and entertainment just steps from our doorstep. Step into our sleek and modern lobby and feel instantly at home in our stylish and thoughtfully appointed accommodations. Each room is designed with contemporary flair and urban sophistication, offering a tranquil oasis amidst the hustle and bustle of the city. Sink into plush bedding, unwind in front of the flat-screen TV, or take in the sweeping city views from your private balcony. With amenities like complimentary Wi-Fi, a fully stocked minibar, and luxury bath amenities, every detail is designed to enhance your stay. Outside your door, the vibrant streets of New York City beckon, with endless opportunities for exploration and adventure. Take a stroll through Central Park, catch a Broadway show, or discover world-class museums and galleries just minutes from our hotel. After a day of sightseeing, return to the hotel and unwind with a cocktail at our rooftop bar, where you can take in panoramic views of the city skyline while sipping on handcrafted cocktails. For those seeking relaxation, our fitness center offers state-of-the-art equipment and personalized training sessions, allowing you to stay active and energized during your stay. Whether you're visiting New York City for business or pleasure, our Urban Boutique Hotel offers the perfect blend of style, sophistication, and convenience for your next city getaway.",
    "price": "$400 per night",
    "status": "Rent",
    "area": "5,000 sq ft",
    "location": "New York City, New York",
    "facilities": ["rooftop bar", "fitness center", "business center", "concierge service"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/trees-forest_C6E84D464A.jpg",
    "estate_title": "Secluded Lakeside Cabin",
    "id": "VAC007",
    "segment_name": "Vacation Rental",
    "description": "Escape to nature in our secluded lakeside cabin, offering peace and tranquility amidst stunning natural surroundings. Nestled on the shores of Lake Tahoe, California, our Secluded Lakeside Cabin offers a peaceful retreat where you can escape the hustle and bustle of everyday life and reconnect with nature. From the moment you arrive, you're greeted by the serene beauty of the surrounding landscape, with towering pine trees, crystal-clear waters, and panoramic mountain views stretching as far as the eye can see. Step into our cozy cabin and feel instantly at home in the warm and inviting interior, where rustic charm meets modern comfort. Curl up by the wood-burning fireplace with a good book, whip up a delicious meal in the fully equipped kitchen, or simply relax on the deck and soak up the sights and sounds of the forest. With multiple bedrooms and bathrooms, our cabin offers plenty of space for families and groups to spread out and enjoy privacy and comfort during their stay. Outside, a private dock beckons, offering direct access to the pristine waters of Lake Tahoe, where you can swim, fish, or simply relax and enjoy the peaceful surroundings. For those seeking adventure, the surrounding area offers a wealth of outdoor activities, from hiking and mountain biking to skiing and snowboarding in the winter months. After a day of exploration, return to the cabin and unwind in the outdoor hot tub, where you can soothe tired muscles while gazing up at the starry night sky. Whether you're seeking outdoor adventure or simply a peaceful retreat amidst nature, our Secluded Lakeside Cabin offers the perfect escape for your next vacation.",
    "price": "$250 per night",
    "status": "Rent",
    "area": "1,800 sq ft",
    "location": "Lake Tahoe, California",
    "facilities": ["lake access", "wood-burning fireplace", "hot tub", "deck with BBQ grill"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/street-city_3QFONGMHT1.jpg",
    "estate_title": "Historic Colonial Guesthouse",
    "id": "GUE008",
    "segment_name": "Guesthouse",
    "description": "Step back in time and experience the charm of colonial architecture in our historic guesthouse, offering elegant accommodations and southern hospitality. Located in the heart of Charleston, South Carolina, our Historic Colonial Guesthouse offers a glimpse into the past, with beautifully preserved architecture, elegant furnishings, and all the modern comforts you need for a memorable stay. From the moment you arrive, you're transported to a bygone era, with cobblestone streets, historic landmarks, and antebellum mansions just steps from our doorstep. Step into our elegant guesthouse and feel instantly at home in the grand foyer, where period details like soaring ceilings, ornate chandeliers, and antique furnishings create an atmosphere of timeless elegance. Each room is tastefully decorated with a blend of traditional charm and modern amenities, offering a serene retreat where you can relax and unwind during your stay. Curl up with a good book in the cozy library lounge, sip a glass of sweet tea on the veranda, or simply admire the views of the courtyard garden from your window. Outside, our tranquil garden offers a peaceful escape where you can stroll along winding pathways, admire blooming flowers, or simply enjoy the sound of chirping birds in the shade of a towering oak tree. For those seeking adventure, our guesthouse offers complimentary bicycle Rentals, allowing you to explore the historic streets of Charleston at your own pace. When it's time to refuel, join us for complimentary afternoon tea served daily in the elegant dining room, where you can enjoy a selection of freshly brewed teas, savory sandwiches, and sweet treats. With its warm hospitality, historic charm, and convenient location near Charleston's top attractions, our Historic Colonial Guesthouse offers the perfect retreat for your next southern getaway.",
    "price": "$180 per night",
    "status": "Rent",
    "area": "1,500 sq ft",
    "location": "Charleston, South Carolina",
    "facilities": ["antique furnishings", "courtyard garden", "complimentary afternoon tea", "library lounge"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/vacation-resort_7XEX5NOW5M.jpg",
    "estate_title": "Mountain Retreat Resort",
    "id": "RES009",
    "segment_name": "Resort",
    "description": "Indulge in mountain luxury at our retreat resort, offering outdoor adventures, spa treatments, and stunning mountain views. Nestled amidst the breathtaking landscape of Banff, Alberta, our Mountain Retreat Resort offers a tranquil escape where you can reconnect with nature, rejuvenate body and mind, and create lasting memories with loved ones. From the moment you arrive, you're greeted by the crisp mountain air, towering peaks, and the promise of adventure that awaits just beyond our doorstep. Step into our welcoming resort and feel instantly at home in our cozy and thoughtfully appointed accommodations. Whether you choose a mountain view suite with panoramic vistas or a cozy cabin nestled in the woods, each space is designed to provide the ultimate in comfort and relaxation during your stay. Curl up by the fireplace with a good book, soak in the stunning views from your private balcony, or pamper yourself with a luxurious bath in the oversized soaking tub. Outside, a world of outdoor exploration awaits, with miles of hiking and biking trails, pristine lakes and rivers, and endless opportunities for adventure in every season. In the winter months, hit the slopes with ski-in/ski-out access to some of the best skiing and snowboarding in the Canadian Rockies, or embark on a guided snowshoeing tour through the scenic backcountry. After a day of adventure, return to the resort and unwind in the onsite spa, where you can indulge in a range of soothing treatments inspired by the natural beauty of the mountains. For those seeking relaxation, our yoga studio offers daily classes in a serene and tranquil setting, allowing you to find balance and harmony amidst the stunning surroundings. Whether you're seeking outdoor adventure, relaxation, or simply a peaceful retreat in nature, our Mountain Retreat Resort offers the perfect escape for your next mountain getaway.",
    "price": "$600 per night",
    "status": "Rent",
    "area": "8,000 sq ft",
    "location": "Banff, Alberta",
    "facilities": ["ski-in/ski-out access", "mountain view suites", "fine dining restaurant", "yoga studio"],
    "view_property_button": "<button>View Property</button>"
  },
  {
    "image": "https://cdn.stocksnap.io/img-thumbs/960w/motel-sign_19C7D208E4.jpg",
    "estate_title": "Retro Roadside Motel",
    "id": "MOT010",
    "segment_name": "Motel",
    "description": "Experience nostalgia in our retro roadside motel, offering a throwback to the golden age of road trips with modern comforts. Located along the iconic Route 66 in Arizona, our Retro Roadside Motel offers a nostalgic trip back in time to the golden age of American road trips. From the moment you arrive, you're greeted by the sight of neon signs, vintage cars, and the promise of adventure that awaits on the open road. Step into our retro motel and feel instantly transported to a bygone era, with themed decor, classic furnishings, and all the modern amenities you need for a comfortable stay. Whether you choose a standard room with a cozy queen bed or a spacious suite with a kitchenette and living area, each space is designed to evoke the charm and nostalgia of a bygone era while offering the comforts of home. Outside, our motel grounds offer plenty of space to relax and unwind, with a sparkling outdoor pool, shaded lounging areas, and a retro diner-style restaurant serving up classic comfort food favorites. For those seeking adventure, the surrounding area offers plenty of opportunities for exploration, from scenic drives along Route 66 to hiking, biking, and horseback riding in the nearby desert landscape. After a day of adventure, return to the motel and unwind with a refreshing dip in the pool, where you can soak up the Arizona sunshine and swap stories with fellow travelers. With its retro charm, modern comforts, and prime location along the historic Route 66, our Retro Roadside Motel offers the perfect blend of nostalgia and comfort for your next road trip adventure.",
    "price": "$80 per night",
    "status": "Rent",
    "area": "1,200 sq ft",
    "location": "Route 66, Arizona",
    "facilities": ["vintage decor", "outdoor pool", "diner-style restaurant", "pet-friendly rooms"],
    "view_property_button": "<button>View Property</button>"
  }
]
